Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
p from load balancer"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.wordpress.aws_security_group_rule.ecs_service_ingress_https[0] will be created
+ resource "aws_security_group_rule" "ecs_service_ingress_https" {
      + description              = "https from load balancer"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.wordpress.aws_security_group_rule.efs_service_ingress_nfs_tcp[0] will be created
+ resource "aws_security_group_rule" "efs_service_ingress_nfs_tcp" {
      + description              = "nfs from efs"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "ingress"
    }

  # module.wordpress.aws_security_group_rule.lb_service_egress_http[0] will be created
+ resource "aws_security_group_rule" "lb_service_egress_http" {
      + description              = "http"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.wordpress.aws_security_group_rule.lb_service_egress_https[0] will be created
+ resource "aws_security_group_rule" "lb_service_egress_https" {
      + description              = "https"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.wordpress.aws_security_group_rule.lb_service_ingress_http[0] will be created
+ resource "aws_security_group_rule" "lb_service_ingress_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "http"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.wordpress.aws_security_group_rule.lb_service_ingress_https[0] will be created
+ resource "aws_security_group_rule" "lb_service_ingress_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "http"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.wordpress.aws_security_group_rule.rds_cluster_ingress_mysql[0] will be created
+ resource "aws_security_group_rule" "rds_cluster_ingress_mysql" {
      + description              = "mysql"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.wordpress.random_password.db_password will be created
+ resource "random_password" "db_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 78 to add, 0 to change, 0 to destroy.

Warning: The CodePipeline GitHub version 1 action provider is deprecated.

  with module.cicd_web.aws_codepipeline.ecommerce,
  on cicd/codepipeline.tf line 154, in resource "aws_codepipeline" "ecommerce":
 154:       provider = "GitHub"

Use a GitHub version 2 action (with a CodeStar Connection
`aws_codestarconnections_connection`) instead. See
https://docs.aws.amazon.com/codepipeline/latest/userguide/update-github-action-connections.html

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra-terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.cmops.tk/lock?id=dhruvdakoria%252Fcreative-market-web-app-devops%252Finfra-terraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra-terraform`
</details>
Plan: 78 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
